{
  "title": "aware",
  "slug": "aware-magazine",
  "description": "Scientific Magazine",
  "description_long": "Developing the online presence for the official student-run, scientific journalistic magazine for Psychology at the University of Zurich.",
  "responsibilities": "Planning, Development, Deployment, Maintanance",
  "project_goal": "Building and deploying a new website for the <strong>aware</strong> magazine. Aligning the digital experience with the print version of the magazine.",
  "accentColor": "rgba(241, 93, 42, 0.5)",
  "url": "http://aware-psymagazin.ch",
  "thumbnail": {
    "src": "/images/aware_thumbnail.png",
    "alt": "Multiple magazine articles stacked on top of each other"
  },
  "circleStyle": {
    "xs": {
      "top": "40%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    },
    "xl": {
      "top": "10%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    }
  },
  "components": [
    {
      "type": "SingleColumnLayout",
      "children": [
        {
          "type": "Image",
          "src": "/images/aware_cover_collage.jpg",
          "alt": "The magazine covers of recent years.",
          "caption": "The magazine covers of recent years. Each one is unique."
        },
        {
          "type": "Text",
          "text": [
            "The magazine aware gives psychology students of the University of Zurich a voice. It creates a space to critically question psychological concepts and the latest research and offers students a way to show their various creative skills besides their chosen study program. The magazine consists of multiple departments, each of them responsible for a different part of the end product. With joined forces, they deliver a beautifully illustrated magazine every semester. You can find it at multiple locations around the city of Zurich.",
            "I felt honored that the aware team had entrusted me with rebuilding their website. Together, we built another pillar for the magazine to stand on. The printed magazine remains the main focus while the new website offers another way of engaging with interested readers. A website that resembles the magazine in an authentic way is essential to reach out to a wider audience. To achieve that goal, I worked together with the magazine’s layout department to build a new digital experience."
          ],
          "classes": "col-lg-10 offset-lg-1"
        },
        {
          "type": "Image",
          "src": "/images/aware_mobile_collage.png",
          "alt": "Two screenshots of the new website. One is the overview page for the Fall 2023 edition and the other is the location page, which lists the various spots where the magazine is available.",
          "caption": "Edition overview page and location page."
        },
        {
          "type": "Text",
          "text": "The project has been built using Next.js for the frontend and Strapi as a content management system for the backend. One requirement was that specialized team members could easily edit the content of the entire website. The Strapi CMS was used exactly for that reason. I am especially proud of this website since it was my first project that I planned and implemented from start to deployment and that is now out there in the wild getting views from interested readers.",
          "classes": "col-lg-10 offset-lg-1"
        },
        {
          "type": "Quote",
          "children": "Articles on this website are going to be read by experts and laypeople alike. It helps pushing psychological research at UZH out to the public.",
          "classes": "col-lg-10 offset-lg-1"
        }
      ]
    },
    {
      "type": "Layout",
      "classes": "breakout",
      "children": [
        {
          "type": "Text",
          "text": "Each article that is released has its own page. In the image you can see hero images for some of the article pages. Giving every article a dedicated page creates space for the article to breathe. Since the website resembles the printed magazine, each article is presented as a self-contained story. Being able to reference specific stories via a unique url is a must-have feature since the magazine must be able to present specifically curated articles at fairs and other events.",
          "classes": "col-xs-12 col-md-5 offset-md-1"
        },
        {
          "type": "Image",
          "src": "/images/aware_article_collage.png",
          "alt": "Several article pages combined in a collage. Each article has a special accent color, which ensures that it gets a unique feel.",
          "classes": "col-xs-12 col-md-6 breakout-md-right"
        }
      ]
    },
    {
      "type": "Layout",
      "classes": "reverse breakout",
      "children": [
        {
          "type": "Text",
          "text": "The articles have infoboxes and quotes that can be dynamically set to the desired position by content managers. The infoboxes usually fulfill the purpose of creating space for additional information that is related to the text but not mandatory for its understanding. Elements like these make the text engaging and reader-friendly since they explain certain topics that not everybody knows about.",
          "classes": "col-xs-12 col-md-6"
        },
        {
          "type": "Image",
          "src": "/images/aware_infobox.png",
          "alt": "An info box and a citation block. Both elements show additional information within an article page.",
          "classes": "col-xs-12 col-md-6 breakout-md-left"
        }
      ]
    },
    {
      "type": "SingleColumnLayout",
      "children": [
        {
          "type": "Text",
          "text": "The website is not only a place where you can find the latest articles related to psychology but also an archive for all past editions. The magazine is eager to digitalize past editions. Until then, every past edition can be downloaded as a PDF.",
          "classes": "col-lg-10 offset-lg-1"
        }
      ]
    }
  ]
}
