{
  "title": "Code Judge",
  "slug": "code-judge",
  "description": "Coding Exercise Platform",
  "description_long": "A small scale prototype for a coding exercise platform.",
  "responsibilities": "Scrum Master, Development",
  "project_goal": "Creating a platform that the university department can use to give out coding homeworks to students. Students should be able to solve coding problems and submit them.",
  "accentColor": "rgba(255, 255, 0, 0.5)",
  "url": "https://drive.google.com/file/d/17y27JgMmgybG8hcISZr3xka14Zunb69N/view?usp=sharing",
  "thumbnail": {
    "src": "/images/codejudge_thumbnail.jpg",
    "alt": "A screenshot of the result page where users can have a look at how many testcases their code has passed"
  },
  "circleStyle": {
    "xs": {
      "top": "40%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    },
    "xl": {
      "top": "10%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    }
  },
  "components": [
    {
      "type": "SingleColumnLayout",
      "children": [
        {
          "type": "Image",
          "src": "/images/codejudge_problem_list.jpg",
          "alt": "A screenshot of the admin overview page where all available coding problems are listed",
          "caption": "A screenshot of the admin overview page where all available coding problems are listed"
        },
        {
          "type": "Text",
          "text": [
            "LeetCode and other platforms that offer to run your code and check if the predefined test cases succeed are perfectly encapsulated exercise spaces for aspiring software engineers. The problem with these platforms is that they are usually run by bigger companies that usually have some financial interest."
          ],
          "classes": "col-lg-10 offset-lg-1"
        },
        {
          "type": "Quote",
          "children": "The CSCE department needed a tool like this to be able to give manually created homework to students so that they can exercise programming on their own.",
          "classes": "col-lg-10 offset-lg-1"
        },
        {
          "type": "Text",
          "text": [
            "Students should be able to run their code solution against predefined test cases and see whether they passed all of the test cases or not.",
            "The application has been developed using Ruby on Rails in a team of 3 people including me as the Scrum Master. Although the application is not in use today I think that it had a great impact on me as an engineer as well as my ability to work together with other team members in an previously unknown domain."
          ],
          "classes": "col-lg-10 offset-lg-1"
        }
      ]
    },
    {
      "type": "Layout",
      "classes": "breakout",
      "children": [
        {
          "type": "Text",
          "text": "For each of the problems students have the ability to view their submission history. Each submission shows the time of submission as well as the status.",
          "classes": "col-xs-12 col-md-5 offset-md-1"
        },
        {
          "type": "Image",
          "src": "/images/codejudge_attempt_history.jpg",
          "alt": "A screenshot of the submission history for a specific coding problem",
          "classes": "col-xs-12 col-md-6 breakout-md-right"
        }
      ]
    },
    {
      "type": "Layout",
      "classes": "reverse breakout",
      "children": [
        {
          "type": "Text",
          "text": "Each problem has its own detail view. This page features the problem statement, the test cases that your code has to pass and a selection of your favorite language. You can upload and submit your file at the bottom of the page.",
          "classes": "col-xs-12 col-md-6"
        },
        {
          "type": "Image",
          "src": "/images/codejudge_problem_statement.jpg",
          "alt": "A screenshot of the problem statement screen",
          "classes": "col-xs-12 col-md-6 breakout-md-left"
        }
      ]
    }
  ]
}
