{
  "title": "PGA Platform",
  "slug": "pga-platform",
  "description": "Visualizing Air Pollution",
  "description_long": "An experimental platform for the data-driven exploration of procedural generation algorithms.",
  "responsibilities": "Research, Planning, Development",
  "project_goal": "Building a system for developers that offers a user interface for the testing of generative algorithms.",
  "accentColor": "rgba(255, 0, 0, 0.5)",
  "thumbnail": {
    "src": "/images/pga_tree_good.jpg",
    "alt": "A green generated tree structure"
  },
  "circleStyle": {
    "xs": {
      "top": "40%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    },
    "xl": {
      "top": "10%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    }
  },
  "components": [
    {
      "type": "SingleColumnLayout",
      "children": [
        {
          "type": "Image",
          "src": "/images/pga_measurement_summer.jpg",
          "alt": "Pollution measurements expressed in the growth and color of three trees",
          "caption": "Pollution measurements expressed in the growth and color of three trees"
        },
        {
          "type": "Text",
          "text": [
            "This project was the main aspect of my Bachelor’s thesis. It is about new and creative ways to do data visualization. Almost everyone should be familiar with the fact that mobility causes emissions. Especially in urban areas where there is much traffic at rush hour. I wanted to make those emissions visible because they can harm the people living in the city. In order to do that I wanted to develop a platform that allows me as a developer to write an algorithm that draws something creative on the screen and integrate that algorithm with an already existing architecture."
          ],
          "classes": "col-lg-10 offset-lg-1"
        },
        {
          "type": "Image",
          "src": "/images/pga_component_diagram.png",
          "alt": "Component diagram of the system",
          "caption": "Component diagram of the system"
        },
        {
          "type": "Text",
          "text": [
            "All the drawing should be influenced by given values that a developer can easily set up using the platform. After development, I showcased the platform using a space colonization algorithm as an example. This specific algorithm was drawing 3D trees that were influenced by the given emission levels. For example, you could set up the algorithm so that it draws the tree much shorter and in red color if there was a lot of nitrogen dioxide (NO2) in the air. The platform essentially does the mapping between measurement and algorithm parameters."
          ],
          "classes": "col-lg-10 offset-lg-1"
        }
      ]
    },
    {
      "type": "Layout",
      "classes": "breakout",
      "children": [
        {
          "type": "Text",
          "text": "The algorithm lays out a bunch of points in a certain 3D shape e.g. a sphere. To simulate the growth of the tree structure, every point acts like a magnet that the branches gravitate towards. You can see a sketch drawing of the mesh generation process. Every branch is built out of multiple branch pieces that are stitched together with an angle that is determined by the gravitation of the points in space.",
          "classes": "col-xs-12 col-md-5 offset-md-1"
        },
        {
          "type": "Image",
          "src": "/images/pga_mesh_generation.png",
          "alt": "Sketch drawing of the mesh generation process",
          "classes": "col-xs-12 col-md-6 breakout-md-right"
        }
      ]
    }
  ]
}
