{
  "title": "Aware",
  "slug": "aware-magazine",
  "description": "Scientific Magazine",
  "description_long": "Developing the online presence for the official student-run, scientific journalistic magazine for Psychology at the University of Zurich.",
  "responsibilities": "Planning, Development, Deployment, Maintanance",
  "project_goal": "Building and deploying a new website for the <strong>aware</strong> magazine. Also aligning the digital experience with the print version of the magazine.",
  "accentColor": "rgba(241, 93, 42, 0.5)",
  "url": "http://dev.aware-psymagazin.ch/ausgabe",
  "thumbnail": {
    "src": "/images/aware_thumbnail.png",
    "alt": "Multiple magazine articles stacked on top of each other"
  },
  "circleStyle": {
    "xs": {
      "top": "40%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    },
    "xl": {
      "top": "10%",
      "left": "100%",
      "width": "70vw",
      "height": "70vw"
    }
  },
  "components": [
    {
      "type": "SingleColumnLayout",
      "children": [
        {
          "type": "Image",
          "src": "/images/aware_article_collage.png",
          "alt": "A chair",
          "caption": "The landing page of the project with a full-screen hero image."
        },
        {
          "type": "Text",
          "text": [
            "Das psychologische Magazin aware gibt Psychologiestudierenden der Universität Zürich eine Stimme. Es schafft einen Raum, um psychologische Konzepte und neue Forschung kritisch zu hinterfragen, bietet den Studierenden aber auch eine Möglichkeit, ihre vielfältigen kreativen Fähigkeiten abseits des gewählten Studiengangs zu zeigen. Das Magazin besteht aus mehreren Ressorts, von denen jedes für einen bestimmten Teil der nächsten Ausgabe verantwortlich ist. Mit vereinten Kräften veröffentlicht das aware jedes Semester ein wunderschön illustriertes Magazin. Dieses liegt an verschiedenen Orten innerhalb der Stadt Zürich zum Mitnehmen aus.",
            "Ich fühle mich geehrt, dass mir das aware die Neugestaltung ihrer Website anvertraut hat. Gemeinsam wollten wir eine weitere Säule des Magazins aufbauen während das gedruckte Magazin dabei aber nach wie vor im Mittelpunkt steht. Die Website soll dazu dienen das Magazin zukünftig einem breiteren Publikum zugänglich zu machen. Sie soll das gedruckte Magazin auf authentische Weise digital erfahrbar machen. Um dies zu erreichen, habe ich Hand in Hand mit der Layout-Abteilung des Magazins zusammengearbeitet."
          ],
          "classes": "col-lg-10 offset-lg-1"
        },
        {
          "type": "Image",
          "src": "/images/aware_mobile_collage.png",
          "alt": "A chair",
          "caption": "Edition overview with associated articles and location page."
        },
        {
          "type": "Text",
          "text": "Das Projekt wurde mit Next.js im Frontend und Strapi als Content-Management-System im Backend realisiert. Eine wichtige Anforderung war, dass spezialisierte Teammitglieder den Inhalt der gesamten Website leicht bearbeiten können. Strapi als Headless CMS bietet genau diese Funktionalität und wurde deshalb eingesetzt. Ich bin besonders stolz auf dieses Projekt, da es das erste war, das ich von Anfang bis Ende selbst geplant und umgesetzt habe und nun täglich von interessierten Lesern genutzt wird.",
          "classes": "col-lg-10 offset-lg-1"
        },
        {
          "type": "Quote",
          "children": "Artikel auf dieser Website werden in Zukunft von Expert*innen sowie auch von Laien gelesen. Sie hilft dabei psychlogische Forschung der Öffentlichkeit zugänglicher zu machen.",
          "classes": "col-lg-10 offset-lg-1"
        }
      ]
    },
    {
      "type": "Layout",
      "classes": "breakout",
      "children": [
        {
          "type": "Text",
          "text": "Jeder Artikel, der veröffentlicht wird, bekommt eine eigene Seite. In der Abbildung sehen Sie Titelbilder für einige dieser Seiten. Jedem Artikel eine eigene Seite zu geben, schafft Raum damit der Artikel wirken kann. Um möglichst nah am gedruckten Magazin zu sein, wird jeder Artikel als in sich geschlossene Geschichte präsentiert. Die Möglichkeit über eine eindeutige URL auf bestimmte Artikel zu verweisen, ist sehr wichtig, da das aware nun in der Lage ist, speziell kuratierte Artikel auf Messen und anderen Veranstaltungen per QR-Code zu präsentieren.",
          "classes": "col-xs-12 col-md-5 offset-md-1"
        },
        {
          "type": "Image",
          "src": "/images/aware_collage_3.png",
          "alt": "A chair",
          "classes": "col-xs-12 col-md-6 breakout-md-right"
        }
      ]
    },
    {
      "type": "Layout",
      "classes": "reverse breakout",
      "children": [
        {
          "type": "Text",
          "text": "Die Artikel selbst verfügen über Infoboxen und Zitate, die von Content-Managern beliebig befüllt und dynamisch an die gewünschte Stelle im Text gesetzt werden können. Die Infoboxen erfüllen in der Regel den Zweck, Platz für zusätzliche Informationen zu schaffen, die mit dem Text in Zusammenhang stehen, aber für das Verständnis des Textes nicht zwingend erforderlich sind. Elemente wie diese machen den Text noch ansprechender und lesenswerter, da sie bestimmte Sachverhalte erklären, die nicht jeder Person geläufig sind.",
          "classes": "col-xs-12 col-md-6"
        },
        {
          "type": "Image",
          "src": "/images/aware_infobox.png",
          "alt": "A chair",
          "classes": "col-xs-12 col-md-6 breakout-md-left"
        }
      ]
    },
    {
      "type": "SingleColumnLayout",
      "children": [
        {
          "type": "Text",
          "text": "Auf der Website finden sich nicht nur die neuesten Artikel zum Thema Psychologie, sondern auch ein Archiv für alle früheren Ausgaben. Das aware arbeitet nun daran, diese vollständig zu digitalisieren. Bis dies der Fall ist, kann jede der früheren Ausgabe als PDF heruntergeladen werden.",
          "classes": "col-lg-10 offset-lg-1"
        }
      ]
    }
  ]
}
